{
  "reviews": [
    {
      "id": 1,
      "titleMain": "Aun Kheng Lim Salted Chicken",
      "titleSub": "Still the Best Salt Baked Chicken in Ipoh",
      "desc": "Are selling one type of salted chicken and only take away available. No others food menu available too, only salted chicken with angelica “dong gui”.",
      "heroImg": "img/salted-chicken.jpg",
      "editor": "Jessica Lim",
      "date": "01-12-2024",
      "rating": 4.1,
      "location": "24 Jalan Theatre, Ipoh 30300 Malaysia",
      "locationLink": "https://www.google.com/maps/place/Ayam+Garam+Aun+Kheng+Lim+(Main+Branch)/@4.5945726,101.080734,17z/data=!3m2!4b1!5s0x31caec635a24d887:0x58961129eb04f668!4m6!3m5!1s0x31caec635b9fa8b9:0x71746847f8bb0733!8m2!3d4.5945726!4d101.0833089!16s%2Fg%2F1ttdkh2_?entry=ttu&g_ep=EgoyMDI1MDgxOS4wIKXMDSoASAFQAw%3D%3D",
      "content": [
        "I went to the shop around 11 a.m. to get some takeaway salt-baked chicken. At RM33 per pack now, it may seem a little pricey, but the convenience is unbeatable — parking was easy during the off-peak hours, and the whole process of buying was incredibly fast. Within minutes, I was handed a whole, steaming hot chicken, neatly wrapped and packed, ready to go. The chicken itself was slightly on the smaller side, but the flavor made up for it — savory, fragrant, and seasoned just right. Despite its name, the saltiness was pleasantly mild, perfectly balanced to bring out the natural taste of the meat without overwhelming it.",
        "../img/saltchicken2.jpg",
        "As someone who has lived in Ipoh and tried almost every salt-baked chicken shop in and around the town, I can confidently say that Aun Keng Lim still serves the best in the Kinta Valley. It’s impressive how they’ve managed to maintain the same consistent quality over decades, something that many competitors struggle with. Of course, the price has risen over time, from RM23 in 2021 to RM33 now, but so has everyone else’s, and for this level of taste and reliability, it still feels worth it.",
        "../img/saltchicken1.jpg",
        "What makes it even more convenient is their option of frozen vacuum-packed chickens. These are perfect for travelers or anyone wanting to bring them interstate. Reheating is simple — just pop it into the microwave for a few minutes or steam it until warm, and you’ve got the same deliciously tender chicken, ready to eat. I often get requests from friends outside Ipoh to bring them a few whenever I travel, and honestly, it’s stress-free and satisfying knowing they’ll enjoy the same authentic flavor. This shop doesn’t just sell chicken — it delivers consistency, tradition, and comfort in every pack."
      ]
    },
    {
      "id": 2,
      "titleMain": "Baba Kaya",
      "titleSub": "The best Ayam penyet in town",
      "desc": "Beautiful address by the canal perfect for breakfast or lunch.",
      "heroImg": "img/baba-kaya.jpg",
      "editor": "Liew Chin Wei",
      "date": "02-03-2025",
      "rating": 4.9,
      "location": "13A Jalan Bunga Raya, Melaka 75100 Malaysia",
      "locationLink": "https://www.google.com/maps/place/Restoran+Baba+Kaya+%E2%80%A2+One+Malaysian+Cuisine/@2.1967375,102.2481622,17z/data=!3m1!4b1!4m6!3m5!1s0x31d1f175fb6eca95:0x8031ee0fcc5ff428!8m2!3d2.1967375!4d102.2507371!16s%2Fg%2F11scmtdt4_?entry=ttu&g_ep=EgoyMDI1MDgxOS4wIKXMDSoASAFQAw%3D%3D",
      "content": [
        "Baba Kaya turned out to be such a delightful surprise — truly a hidden gem by the Melaka river. I still remember strolling along with my family when we heard the ringing of a bell. Looking up, there was someone waving us over to a bright blue building that instantly caught our attention. Curious, my mum said, “let’s go have a look!” and it turned out to be one of the best decisions of our trip. The place was lively, full of people, and had that inviting, homely vibe that made us excited even before trying the food.",
        "../img/babakaya1.jpg",
        "The dishes did not disappoint at all. The grandma chicken broth was heartwarming and flavorful, though the bihun was slightly overcooked and a little mushy, which took away from the overall enjoyment — but the rich broth itself carried so much comfort it was still worth savoring. The sambal, on the other hand, was an absolute highlight: fragrant, spicy, and just the right kick to elevate every bite. The prawn nyonya curry laksa was another standout, with a broth that was creamy and bold, perfectly balanced by the freshness of tauge and sliced timun that added a refreshing crunch. Even the fun little details stood out — the adorable “twin tower rice” served with a generous side of sambal made the meal memorable and playful, while the drinks were refreshing and paired well with the heat of the dishes.",
        "../img/babakaya2.jpg",
        "Beyond the food, the staff made the experience exceptional. They were warm, welcoming, and attentive, going out of their way to make us feel comfortable from the moment we stepped in. Every dish was bursting with flavor, and every interaction felt genuine. Baba Kaya managed to deliver not just a meal, but a wholesome, heartwarming experience that made us want to come back. For anyone who loves delicious, soulful food with excellent service and a cozy riverside atmosphere, this is a must-visit spot in Melaka."
      ]
    },
    {
      "id": 3,
      "titleMain": "Langkawi Kitchen",
      "titleSub": "Plunging your palate into the diversity of Langkawi’s vibrant culinary scene.",
      "desc": "Charred noodles with prawns, cockles, and Chinese sausage — Penang’s pride.",
      "heroImg": "img/langkawi-kitchen.jpg",
      "editor": "Ryan Lee",
      "date": "05-09-2022",
      "rating": 4.9,
      "location": "199 Jalan Pantai Kok The Ritz-Carlton, Langkawi, Langkawi 07000 Malaysia",
      "locationLink": "https://www.google.com/maps/place/The+Ritz-Carlton,+Langkawi/@6.3589428,99.6927295,17z/data=!4m10!3m9!1s0x304c770a06a8c6bf:0x86c6964cc76c9f09!5m3!1s2025-09-18!4m1!1i2!8m2!3d6.3589428!4d99.6953044!16s%2Fg%2F11f0wr_dcg?entry=ttu&g_ep=EgoyMDI1MDgxOS4wIKXMDSoASAFQAw%3D%3D",
      "content": [
        "Langkawi Kitchen is truly a treasure that combines impeccable service with extraordinary cuisine. From the very beginning, the atmosphere set the tone for an unforgettable evening. Even though we arrived slightly late for our reservation, the staff welcomed us warmly and seated us right away, showing not just efficiency but genuine hospitality. The service throughout was spectacular — attentive without being intrusive, and the staff clearly knew the menu inside out, recommending dishes and cocktails that matched our preferences perfectly. Everything about the space was clean, stylish, and inviting, adding to the sense that this was not just a meal, but an experience.",
        "../img/lk2.jpg",
        "The culinary journey was equally exceptional. We were fortunate to enjoy a Chef’s Special Thai dinner prepared by Chefs Hafiz, Hadi, Pian, and Zam — each dish was executed with precision and creativity. The standout was the seabass: sweet, sour, and spicy in perfect harmony, bursting with flavors that lingered long after each bite. Every plate that came out felt thoughtful and beautifully crafted, making it a true feast for both the eyes and the palate. Compliments must also go to the attentive service by staff members like Dija and Miss Gan, who elevated the dining experience with their warmth, professionalism, and genuine care.",
        "../img/lk1.jpg",
        "Together, the remarkable food and heartfelt service created an evening to remember. Langkawi Kitchen is more than just a restaurant — it’s a destination where hospitality and culinary artistry come together seamlessly. With its refined ambience, excellent staff, and dishes worth every cent, it stands as a must-visit for anyone seeking not just dinner, but a memorable and meaningful dining experience."
      ]
    }
  ],
  
  "funfacts": [
    "Many Malaysian stalls are multi-generational—recipes are guarded family secrets.",
    "Char Kway Teow’s “wok hei” comes from high heat and quick stir-frying.",
    "Nasi lemak literally means “rich rice”, referring to coconut milk richness.",
    "Satay likely spread across Southeast Asia through Malay and Javanese traders.",
    "Penang hawker centres are UNESCO-recognized for cultural food heritage.",
    "Teh tarik is “pulled” to cool the drink and create microfoam."
  ]
}